app/controllers/admin/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    auctions = Auction.all

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 72]]
---
  def show
    auction = Auction.find(params[:id])

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 281]]
---
  def preview
    auction = Auction.find(params[:id])

INSERT INTO "auctions" ("title", "description", "summary", "github_repo", "issue_url", "delivery_deadline", "awardee_paid_status", "published", "notes", "billable_to", "result", "start_price", "start_datetime", "end_datetime", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @auction = CreateAuction.new(params, current_user).auction

    if @auction.save

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 277]]
---
  def edit
    @auction = Admin::EditAuctionViewModel.new(Auction.find(params[:id]))

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 277]]
---
  def update
    auction = Auction.find(params[:id])