app/controllers/admin/users_controller.rb

    def index
      all_users = User.all.map {|user| Presenter::User.new(user) }
---
SELECT "users".* FROM "users"

    def update
      @user = User.find(params[:id])

      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 864]]
UPDATE "users" SET "contracting_officer" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["contracting_officer", "t"], ["updated_at", "2016-05-19 14:42:43.776830"], ["id", 864]]