app/views/bids/index.html.erb

<% content_for :title do %>18F Micro-purchase - Bids on <%= @auction.title %><% end %>
<% content_for :description do %>Auction <%= @auction.id %> has <%= @auction.bids.length %> bids.<% end %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" IN (13)