app/views/admin/auctions/show.html.erb


    <% @auction.bids.each do |bid| %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  ORDER BY "bids"."created_at" DESC  [["auction_id", 275]]