app/views/auctions/multi_bid/_index_bid_summary.html.erb

    <span class="current-bid"><%= number_to_currency(auction.current_bid_amount) %>  </span><br/>
    <span class="current-bid-link"><%=
    link_to(
      pluralize(auction.bids.length, 'bid'),
      auction_bids_path(auction.id)
    )
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  ORDER BY "bids"."created_at" DESC  [["auction_id", 275]]