app/views/auctions/multi_bid/_win_header.html.erb

<% if auction.over? %>
  <% if auction.bids.any? %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  ORDER BY "bids"."created_at" DESC  [["auction_id", 291]]