app/controllers/bids_controller.rb

  def my_bids
    @bids = Bid.where(bidder_id: current_user.id)
            .includes(:auction)
            .all
            .map {|bid| Presenter::Bid.new(bid)}
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" IN (21)
SELECT "bids".* FROM "bids" WHERE "bids"."bidder_id" = $1  [["bidder_id", 31]]

  def confirm
    @auction = Policy::Auction.factory(Auction.find(params[:auction_id]), current_user)
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 297]]

  def create
    fail UnauthorizedError, "You must have a valid SAM.gov account to place a bid" unless current_user.sam_account?
    @auction = Policy::Auction.factory(Auction.find(params[:auction_id]), current_user)
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 129]]