app/views/admin/users/index.html.erb

SELECT "users".* FROM "users"
---
<h2>
  Users (<%= @users.length %>); w/ DUNS (<%= @admin_report.non_admin_users_with_duns.length %>); In SAM (<%= @admin_report.non_admin_users_in_sam.length %>)